[
    [
        "Why did you create this?",
        "I was curious how the game worked internally. So I decided to make this app a by-product of that information."
    ],
    [
        "Why do you require an in-game purchase to use this app?",
        "Initially, I didn't have this in place. However, I realized that this app can give you the advantages of one of the in-game purchases (Permanent Ad Reward). This means the app could lessen the game creator's monetary support. So, I either had to kill this project or implement the purchase requirement."
    ],
    [
        "This app is open source, but why is part of it obfuscated? What are you hiding?",
        "The obfuscated file is <kbd>crypto.js</kbd>. This is the file that handles the decryption, encryption, and in-game purchase verification.<br /><br />Yes, JavaScript obfuscation is reversible. Still, I believe that anyone who is successful at deobfuscation could decrypt the save games themselves anyway.<br /><br />Anyone wishing to have a closer look at this file for security purposes can contact me."
    ],
    [
        "Why does this app potentially disallow me from participating in the leaderboard?",
        "The Exponential Idle game developer requested that a flag be set on exported save games so that the leaderboard could remain reputable. The original request was to only enable this flag for cheaty save game edits. However, the implementation of obscurity doesn't allow the Crypto class to know if something cheaty, specifically, was edited. Any implementation where it could know would either require additional obfuscated sources files or laughable bypass opportunities. I didn't like either of those options, so I opted to flag all save games."
    ],
    [
        "Why did you make this open-source at all?",
        "It is my deepest hope that someone can use any or all of this code to learn something new."
    ],
    [
        "Where did the translations come from?",
        "The game has a beautiful language mechanism and a fantastic team of translators. Where possible, I tried to use game keywords so that this app could be automatically translated, even at a small cost of clarity."
    ],
    [
        "I am the author of one of the translations. Unfortunately, I do not want you to use my work. Can you remove it?",
        "Send a pull request with the <kbd>src/lib/i18n.csv</kbd> file edited and proof that you are its author to remove your work."
    ],
    [
        "If I load and export a save without changing anything, the save data string changes. Why?",
        "Three main reasons:<ol><li>Date precision for milliseconds is less precise in the web browser versus the game. This doesn't really effect gameplay, but it prevents exact recreations of the save string.</li><li>Big number precision is less due to the web browser holding less decimal places in total. This doesn't really effect gameplay, but it prevents exact recreations of the save string.</li><li>Save game strings are compressed before they are encrypted. The game doesn't use the highest compression possible when exporting, this app does. The game can still load the higher compressed save strings so it's a win/win.</li></ol>"
    ],
    [
        "The app doesn't work!",
        "Make an issue in this app's Github repo following the proper issue guidelines."
    ],
    [
        "The app corrupted my save!",
        "As noted on the main page, this app is not responsible for any broken save. Therefore, make a backup of your save first."
    ],
    [
        "The app froze my phone!",
        "This can happen if the game attempts to load an invalid save. If this happens, please make an issue in this app's Github repo and include what you changed."
    ],
    [
        "What are some practical, non-cheaty things you can do?",
        "<ul><li>Automatically update your permanent star levels and students without having to enter each value into the game manually.</li><li>Recover your game if you lost it and don't want to start over.</li><li>See more accurate numbers that get truncated in game for space saving reasons.</li><li>Edit long auto-prestige and auto-supremacy formulas easier.</li><li>Test different game play methods quickly to find optimal speed running strategies.</li></ul>"
    ],
    [
        "What are some practical, kinda-cheaty things you can do?",
        "<ul><li>Change the current in-game time to speed through offline progress (maximum 1 week at a time).</li><li>Change the automation rate to be much faster than what the star bonus reward gives you. Careful, you might lag your game!</li><li>Unlock the minigames early because you fucking love minigames.</li><li>Unlock auto-buy for Theories you haven't even unlocked yet; skip the initial grind!</li><li>Change the default acceleration rate to act like you're always holding the acceleration button.</li></ul>"
    ],
    [
        "What's the Raw Data section?",
        "This is all the data from the save game in its <em>(mostly)</em> raw form. Editing values in other sections will update the Raw Data section as well, sometimes in multiple places. Be careful editing directly in this area as there are fewer checks for invalid inputs."
    ],
    [
        "I changed some things, but they didn't affect the game at all. What things can you not do?",
        "Some of the items require something to be changed in multiple places in <kbd>Raw Data</kbd>. If you're directly editing in <kbd>Raw Data</kbd> you may need to edit things in multiple places.<br /><br />There are also some things in the save game that the game will not load when doing an import from paste:<ul><li>Any of the items in <kbd>Raw Data > Option</kbd></li><li>Any of the items in <kbd>Raw Data > Rewards</kbd></li><li>Any of the items in <kbd>Raw Data > Session</kbd> that relate to purchases or asks.</li><li><kbd>Raw Data > Session > HasGoneBackwardInTime</kbd></li><li>Any of the items in <kbd>Raw Data > Statistics</kbd> that relate to installation time.</li>"
    ],
    [
        "What about other games?",
        "If the game works similarly (import/export of save games), and the game is interesting, send me an email."
    ]
]